HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/**
 * \file IfxMc_reg.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC29X_UM_V1.1.R1
 * Specification: tc29x_um_v1.1p4_SFR_OPEN_MARKET.xml (Revision: UM_V1.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Mc_Cfg Mc address
 * \ingroup IfxLld_Mc
 * 
 * \defgroup IfxLld_Mc_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc0 2-MC0
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc1 2-MC1
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc2 2-MC2
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc3 2-MC3
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc4 2-MC4
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc5 2-MC5
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc6 2-MC6
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc7 2-MC7
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc8 2-MC8
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc9 2-MC9
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc10 2-MC10
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc11 2-MC11
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc12 2-MC12
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc13 2-MC13
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc14 2-MC14
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc15 2-MC15
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc16 2-MC16
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc17 2-MC17
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc18 2-MC18
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc19 2-MC19
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc20 2-MC20
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc21 2-MC21
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc22 2-MC22
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc23 2-MC23
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc24 2-MC24
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc25 2-MC25
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc26 2-MC26
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc27 2-MC27
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc28 2-MC28
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc29 2-MC29
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc30 2-MC30
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc31 2-MC31
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc32 2-MC32
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc33 2-MC33
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc34 2-MC34
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc35 2-MC35
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc36 2-MC36
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc37 2-MC37
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc38 2-MC38
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc39 2-MC39
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc40 2-MC40
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc41 2-MC41
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc42 2-MC42
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc43 2-MC43
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc44 2-MC44
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc45 2-MC45
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc46 2-MC46
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc47 2-MC47
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc48 2-MC48
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc49 2-MC49
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc50 2-MC50
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc51 2-MC51
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc52 2-MC52
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc53 2-MC53
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc54 2-MC54
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc55 2-MC55
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc56 2-MC56
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc57 2-MC57
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc58 2-MC58
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc59 2-MC59
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc60 2-MC60
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc61 2-MC61
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc62 2-MC62
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc63 2-MC63
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc64 2-MC64
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc65 2-MC65
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc66 2-MC66
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc67 2-MC67
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc68 2-MC68
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc69 2-MC69
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc70 2-MC70
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc71 2-MC71
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc72 2-MC72
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc73 2-MC73
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc74 2-MC74
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc75 2-MC75
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc76 2-MC76
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc77 2-MC77
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc78 2-MC78
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc79 2-MC79
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc80 2-MC80
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc81 2-MC81
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc82 2-MC82
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc83 2-MC83
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc84 2-MC84
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc85 2-MC85
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc86 2-MC86
 * \ingroup IfxLld_Mc_Cfg
 * 
 * \defgroup IfxLld_Mc_Cfg_Mc87 2-MC87
 * \ingroup IfxLld_Mc_Cfg
 * 
 */
#ifndef IFXMC_REG_H
#define IFXMC_REG_H 1
/******************************************************************************/
#include "IfxMc_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_BaseAddress
 * \{  */

/** \\brief  MC object */
#define MODULE_MC0 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061000u))

/** \\brief  MC object */
#define MODULE_MC1 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061100u))

/** \\brief  MC object */
#define MODULE_MC10 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061A00u))

/** \\brief  MC object */
#define MODULE_MC11 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061B00u))

/** \\brief  MC object */
#define MODULE_MC12 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061C00u))

/** \\brief  MC object */
#define MODULE_MC13 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061D00u))

/** \\brief  MC object */
#define MODULE_MC14 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061E00u))

/** \\brief  MC object */
#define MODULE_MC15 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061F00u))

/** \\brief  MC object */
#define MODULE_MC16 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062000u))

/** \\brief  MC object */
#define MODULE_MC17 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062100u))

/** \\brief  MC object */
#define MODULE_MC18 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062200u))

/** \\brief  MC object */
#define MODULE_MC19 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062300u))

/** \\brief  MC object */
#define MODULE_MC2 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061200u))

/** \\brief  MC object */
#define MODULE_MC20 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062400u))

/** \\brief  MC object */
#define MODULE_MC21 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062500u))

/** \\brief  MC object */
#define MODULE_MC22 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062600u))

/** \\brief  MC object */
#define MODULE_MC23 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062700u))

/** \\brief  MC object */
#define MODULE_MC24 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062800u))

/** \\brief  MC object */
#define MODULE_MC25 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062900u))

/** \\brief  MC object */
#define MODULE_MC26 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062A00u))

/** \\brief  MC object */
#define MODULE_MC27 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062B00u))

/** \\brief  MC object */
#define MODULE_MC28 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062C00u))

/** \\brief  MC object */
#define MODULE_MC29 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062D00u))

/** \\brief  MC object */
#define MODULE_MC3 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061300u))

/** \\brief  MC object */
#define MODULE_MC30 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062E00u))

/** \\brief  MC object */
#define MODULE_MC31 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0062F00u))

/** \\brief  MC object */
#define MODULE_MC32 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063000u))

/** \\brief  MC object */
#define MODULE_MC33 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063100u))

/** \\brief  MC object */
#define MODULE_MC34 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063200u))

/** \\brief  MC object */
#define MODULE_MC35 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063300u))

/** \\brief  MC object */
#define MODULE_MC36 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063400u))

/** \\brief  MC object */
#define MODULE_MC37 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063500u))

/** \\brief  MC object */
#define MODULE_MC38 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063600u))

/** \\brief  MC object */
#define MODULE_MC39 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063700u))

/** \\brief  MC object */
#define MODULE_MC4 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061400u))

/** \\brief  MC object */
#define MODULE_MC40 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063800u))

/** \\brief  MC object */
#define MODULE_MC41 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063900u))

/** \\brief  MC object */
#define MODULE_MC42 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063A00u))

/** \\brief  MC object */
#define MODULE_MC43 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063B00u))

/** \\brief  MC object */
#define MODULE_MC44 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063C00u))

/** \\brief  MC object */
#define MODULE_MC45 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063D00u))

/** \\brief  MC object */
#define MODULE_MC46 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063E00u))

/** \\brief  MC object */
#define MODULE_MC47 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0063F00u))

/** \\brief  MC object */
#define MODULE_MC48 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064000u))

/** \\brief  MC object */
#define MODULE_MC49 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064100u))

/** \\brief  MC object */
#define MODULE_MC5 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061500u))

/** \\brief  MC object */
#define MODULE_MC50 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064200u))

/** \\brief  MC object */
#define MODULE_MC51 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064300u))

/** \\brief  MC object */
#define MODULE_MC52 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064400u))

/** \\brief  MC object */
#define MODULE_MC53 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064500u))

/** \\brief  MC object */
#define MODULE_MC54 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064600u))

/** \\brief  MC object */
#define MODULE_MC55 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064700u))

/** \\brief  MC object */
#define MODULE_MC56 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064800u))

/** \\brief  MC object */
#define MODULE_MC57 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064900u))

/** \\brief  MC object */
#define MODULE_MC58 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064A00u))

/** \\brief  MC object */
#define MODULE_MC59 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064B00u))

/** \\brief  MC object */
#define MODULE_MC6 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061600u))

/** \\brief  MC object */
#define MODULE_MC60 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064C00u))

/** \\brief  MC object */
#define MODULE_MC61 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064D00u))

/** \\brief  MC object */
#define MODULE_MC62 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064E00u))

/** \\brief  MC object */
#define MODULE_MC63 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0064F00u))

/** \\brief  MC object */
#define MODULE_MC64 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065000u))

/** \\brief  MC object */
#define MODULE_MC65 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065100u))

/** \\brief  MC object */
#define MODULE_MC66 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065200u))

/** \\brief  MC object */
#define MODULE_MC67 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065300u))

/** \\brief  MC object */
#define MODULE_MC68 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065400u))

/** \\brief  MC object */
#define MODULE_MC69 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065500u))

/** \\brief  MC object */
#define MODULE_MC7 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061700u))

/** \\brief  MC object */
#define MODULE_MC70 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065600u))

/** \\brief  MC object */
#define MODULE_MC71 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065700u))

/** \\brief  MC object */
#define MODULE_MC72 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065800u))

/** \\brief  MC object */
#define MODULE_MC73 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065900u))

/** \\brief  MC object */
#define MODULE_MC74 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065A00u))

/** \\brief  MC object */
#define MODULE_MC75 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065B00u))

/** \\brief  MC object */
#define MODULE_MC76 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065C00u))

/** \\brief  MC object */
#define MODULE_MC77 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065D00u))

/** \\brief  MC object */
#define MODULE_MC78 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065E00u))

/** \\brief  MC object */
#define MODULE_MC79 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0065F00u))

/** \\brief  MC object */
#define MODULE_MC8 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061800u))

/** \\brief  MC object */
#define MODULE_MC80 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0066000u))

/** \\brief  MC object */
#define MODULE_MC81 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0066100u))

/** \\brief  MC object */
#define MODULE_MC82 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0066200u))

/** \\brief  MC object */
#define MODULE_MC83 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0066300u))

/** \\brief  MC object */
#define MODULE_MC84 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0066400u))

/** \\brief  MC object */
#define MODULE_MC85 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0066500u))

/** \\brief  MC object */
#define MODULE_MC86 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0066600u))

/** \\brief  MC object */
#define MODULE_MC87 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0066700u))

/** \\brief  MC object */
#define MODULE_MC9 /*lint --e(923)*/ ((*(Ifx_MC*)0xF0061900u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc0
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC0_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061000u)

/** \\brief  2, Configuration Register 1 */
#define MC0_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061002u)

/** \\brief  10, Memory ECC Detection Register */
#define MC0_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061010u)

