HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/** \\brief  E, ECC Safety Register */
#define MC0_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006100Eu)

/** \\brief  12, Error Tracking Register */
#define MC0_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061012u)

/** \\brief  14, Error Tracking Register */
#define MC0_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061014u)

/** \\brief  16, Error Tracking Register */
#define MC0_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061016u)

/** \\brief  18, Error Tracking Register */
#define MC0_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061018u)

/** \\brief  1A, Error Tracking Register */
#define MC0_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006101Au)

/** \\brief  4, MBIST Control Register */
#define MC0_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061004u)

/** \\brief  6, Status Register */
#define MC0_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061006u)

/** \\brief  8, Range Register, single address mode */
#define MC0_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061008u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC0_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC0_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC0_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC0_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC0_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC0_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC0_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC0_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC0_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC0_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC0_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC0_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC0_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC0_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC0_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC0_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC0_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC0_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC0_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC0_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC0_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC0_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC0_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC0_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC0_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC0_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC0_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC0_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC0_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC0_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610E6u)

/** \\brief  E8, Read Data and Bit Flip Register */
#define MC0_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC0_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC0_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC0_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC0_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC0_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC0_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC0_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC0_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC0_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00610B2u)

