HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC3_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC3_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC3_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC3_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC3_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC3_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC3_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC3_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC3_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC3_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613B2u)

/** \\brief  C, Revision ID Register */
#define MC3_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006130Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc4
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC4_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061400u)

/** \\brief  2, Configuration Register 1 */
#define MC4_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061402u)

/** \\brief  10, Memory ECC Detection Register */
#define MC4_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061410u)

/** \\brief  E, ECC Safety Register */
#define MC4_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006140Eu)

/** \\brief  12, Error Tracking Register */
#define MC4_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061412u)

/** \\brief  14, Error Tracking Register */
#define MC4_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061414u)

/** \\brief  16, Error Tracking Register */
#define MC4_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061416u)

/** \\brief  18, Error Tracking Register */
#define MC4_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061418u)

/** \\brief  1A, Error Tracking Register */
#define MC4_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006141Au)

/** \\brief  4, MBIST Control Register */
#define MC4_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061404u)

/** \\brief  6, Status Register */
#define MC4_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061406u)

/** \\brief  8, Range Register, single address mode */
#define MC4_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061408u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC4_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC4_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC4_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC4_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC4_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC4_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC4_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC4_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC4_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC4_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC4_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC4_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC4_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC4_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC4_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC4_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC4_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC4_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC4_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC4_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC4_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC4_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC4_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC4_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC4_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC4_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC4_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC4_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC4_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC4_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00614E6u)

