HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC11_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC11_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC11_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC11_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC11_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC11_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC11_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC11_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC11_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC11_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BB2u)

/** \\brief  C, Revision ID Register */
#define MC11_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0061B0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc12
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC12_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061C00u)

/** \\brief  2, Configuration Register 1 */
#define MC12_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061C02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC12_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061C10u)

/** \\brief  E, ECC Safety Register */
#define MC12_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0061C0Eu)

/** \\brief  12, Error Tracking Register */
#define MC12_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061C12u)

/** \\brief  14, Error Tracking Register */
#define MC12_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061C14u)

/** \\brief  16, Error Tracking Register */
#define MC12_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061C16u)

/** \\brief  18, Error Tracking Register */
#define MC12_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061C18u)

/** \\brief  1A, Error Tracking Register */
#define MC12_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061C1Au)

/** \\brief  4, MBIST Control Register */
#define MC12_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061C04u)

/** \\brief  6, Status Register */
#define MC12_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061C06u)

/** \\brief  8, Range Register, single address mode */
#define MC12_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061C08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC12_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC12_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC12_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC12_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC12_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC12_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC12_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC12_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC12_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC12_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC12_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC12_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC12_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC12_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC12_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CCAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC12_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CCCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC12_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CCEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC12_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CD0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC12_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CD2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC12_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CD4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC12_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CD6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC12_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CD8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC12_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC12_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC12_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC12_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC12_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC12_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC12_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC12_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CE6u)

