HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC26_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC26_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC26_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC26_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC26_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC26_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC26_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC26_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC26_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC26_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062AB2u)

/** \\brief  C, Revision ID Register */
#define MC26_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0062A0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc27
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC27_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062B00u)

/** \\brief  2, Configuration Register 1 */
#define MC27_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062B02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC27_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062B10u)

/** \\brief  E, ECC Safety Register */
#define MC27_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0062B0Eu)

/** \\brief  12, Error Tracking Register */
#define MC27_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062B12u)

/** \\brief  14, Error Tracking Register */
#define MC27_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062B14u)

/** \\brief  16, Error Tracking Register */
#define MC27_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062B16u)

/** \\brief  18, Error Tracking Register */
#define MC27_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062B18u)

/** \\brief  1A, Error Tracking Register */
#define MC27_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062B1Au)

/** \\brief  4, MBIST Control Register */
#define MC27_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062B04u)

/** \\brief  6, Status Register */
#define MC27_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062B06u)

/** \\brief  8, Range Register, single address mode */
#define MC27_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062B08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC27_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC27_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC27_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC27_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC27_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC27_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC27_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC27_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC27_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC27_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC27_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC27_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC27_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC27_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC27_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BCAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC27_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BCCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC27_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BCEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC27_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BD0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC27_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BD2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC27_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BD4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC27_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BD6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC27_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BD8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC27_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC27_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC27_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC27_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC27_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC27_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC27_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC27_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BE6u)

