HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC32_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC32_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC32_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC32_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC32_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC32_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC32_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC32_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC32_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC32_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630B2u)

/** \\brief  C, Revision ID Register */
#define MC32_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006300Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc33
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC33_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063100u)

/** \\brief  2, Configuration Register 1 */
#define MC33_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063102u)

/** \\brief  10, Memory ECC Detection Register */
#define MC33_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063110u)

/** \\brief  E, ECC Safety Register */
#define MC33_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006310Eu)

/** \\brief  12, Error Tracking Register */
#define MC33_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063112u)

/** \\brief  14, Error Tracking Register */
#define MC33_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063114u)

/** \\brief  16, Error Tracking Register */
#define MC33_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063116u)

/** \\brief  18, Error Tracking Register */
#define MC33_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063118u)

/** \\brief  1A, Error Tracking Register */
#define MC33_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006311Au)

/** \\brief  4, MBIST Control Register */
#define MC33_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063104u)

/** \\brief  6, Status Register */
#define MC33_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063106u)

/** \\brief  8, Range Register, single address mode */
#define MC33_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063108u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC33_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC33_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC33_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC33_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC33_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC33_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC33_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC33_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC33_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC33_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC33_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC33_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC33_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC33_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC33_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC33_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC33_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC33_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC33_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC33_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC33_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC33_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC33_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC33_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC33_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC33_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC33_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC33_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC33_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC33_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E6u)

