HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC33_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC33_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC33_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC33_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC33_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC33_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC33_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC33_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC33_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC33_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B2u)

/** \\brief  C, Revision ID Register */
#define MC33_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006310Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc34
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC34_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063200u)

/** \\brief  2, Configuration Register 1 */
#define MC34_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063202u)

/** \\brief  10, Memory ECC Detection Register */
#define MC34_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063210u)

/** \\brief  E, ECC Safety Register */
#define MC34_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006320Eu)

/** \\brief  12, Error Tracking Register */
#define MC34_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063212u)

/** \\brief  14, Error Tracking Register */
#define MC34_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063214u)

/** \\brief  16, Error Tracking Register */
#define MC34_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063216u)

/** \\brief  18, Error Tracking Register */
#define MC34_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063218u)

/** \\brief  1A, Error Tracking Register */
#define MC34_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006321Au)

/** \\brief  4, MBIST Control Register */
#define MC34_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063204u)

/** \\brief  6, Status Register */
#define MC34_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063206u)

/** \\brief  8, Range Register, single address mode */
#define MC34_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063208u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC34_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC34_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC34_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC34_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC34_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC34_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC34_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC34_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC34_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC34_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC34_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC34_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC34_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC34_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC34_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC34_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC34_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC34_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC34_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC34_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC34_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC34_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC34_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC34_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC34_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC34_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC34_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC34_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC34_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC34_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00632E6u)

