HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC40_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC40_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC40_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC40_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC40_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC40_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC40_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC40_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC40_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC40_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638B2u)

/** \\brief  C, Revision ID Register */
#define MC40_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006380Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc41
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC41_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063900u)

/** \\brief  2, Configuration Register 1 */
#define MC41_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063902u)

/** \\brief  10, Memory ECC Detection Register */
#define MC41_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063910u)

/** \\brief  E, ECC Safety Register */
#define MC41_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006390Eu)

/** \\brief  12, Error Tracking Register */
#define MC41_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063912u)

/** \\brief  14, Error Tracking Register */
#define MC41_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063914u)

/** \\brief  16, Error Tracking Register */
#define MC41_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063916u)

/** \\brief  18, Error Tracking Register */
#define MC41_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063918u)

/** \\brief  1A, Error Tracking Register */
#define MC41_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006391Au)

/** \\brief  4, MBIST Control Register */
#define MC41_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063904u)

/** \\brief  6, Status Register */
#define MC41_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063906u)

/** \\brief  8, Range Register, single address mode */
#define MC41_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063908u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC41_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC41_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC41_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC41_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC41_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC41_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC41_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC41_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC41_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC41_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC41_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC41_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC41_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC41_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC41_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC41_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC41_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC41_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC41_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC41_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC41_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC41_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC41_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC41_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC41_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC41_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC41_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC41_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC41_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC41_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00639E6u)

