HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC50_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC50_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC50_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC50_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC50_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC50_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC50_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC50_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC50_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC50_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00642B2u)

/** \\brief  C, Revision ID Register */
#define MC50_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006420Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc51
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC51_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064300u)

/** \\brief  2, Configuration Register 1 */
#define MC51_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064302u)

/** \\brief  10, Memory ECC Detection Register */
#define MC51_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064310u)

/** \\brief  E, ECC Safety Register */
#define MC51_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006430Eu)

/** \\brief  12, Error Tracking Register */
#define MC51_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064312u)

/** \\brief  14, Error Tracking Register */
#define MC51_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064314u)

/** \\brief  16, Error Tracking Register */
#define MC51_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064316u)

/** \\brief  18, Error Tracking Register */
#define MC51_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064318u)

/** \\brief  1A, Error Tracking Register */
#define MC51_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006431Au)

/** \\brief  4, MBIST Control Register */
#define MC51_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064304u)

/** \\brief  6, Status Register */
#define MC51_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064306u)

/** \\brief  8, Range Register, single address mode */
#define MC51_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064308u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC51_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC51_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC51_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC51_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC51_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC51_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC51_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC51_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC51_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC51_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC51_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC51_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC51_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC51_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC51_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC51_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC51_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC51_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC51_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC51_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC51_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC51_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC51_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC51_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC51_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC51_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC51_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC51_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC51_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC51_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643E6u)

