HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC68_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC68_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC68_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC68_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC68_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC68_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC68_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC68_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC68_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC68_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654B2u)

/** \\brief  C, Revision ID Register */
#define MC68_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006540Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc69
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC69_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065500u)

/** \\brief  2, Configuration Register 1 */
#define MC69_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065502u)

/** \\brief  10, Memory ECC Detection Register */
#define MC69_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065510u)

/** \\brief  E, ECC Safety Register */
#define MC69_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006550Eu)

/** \\brief  12, Error Tracking Register */
#define MC69_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065512u)

/** \\brief  14, Error Tracking Register */
#define MC69_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065514u)

/** \\brief  16, Error Tracking Register */
#define MC69_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065516u)

/** \\brief  18, Error Tracking Register */
#define MC69_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065518u)

/** \\brief  1A, Error Tracking Register */
#define MC69_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006551Au)

/** \\brief  4, MBIST Control Register */
#define MC69_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065504u)

/** \\brief  6, Status Register */
#define MC69_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065506u)

/** \\brief  8, Range Register, single address mode */
#define MC69_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065508u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC69_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC69_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC69_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC69_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC69_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC69_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC69_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC69_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC69_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC69_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC69_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC69_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC69_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC69_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC69_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC69_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC69_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC69_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC69_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC69_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC69_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC69_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC69_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC69_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC69_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC69_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC69_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC69_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC69_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC69_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655E6u)

